FrameOS/frameos/embedded/esp32/main/fos_config.c
#include "fos_config.h"

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <strings.h>

#include "driver/gpio.h"
#include "esp_log.h"
#include "esp_private/esp_gpio_reserve.h"
#include "nvs.h"
#include "nvs_flash.h"
#include "sdkconfig.h"
#include "soc/soc_caps.h"

#include "fos_defaults.h"

/* The pure parsers/normalisers (`set pins`, `set rotate`, GPIO buttons …)
 * live in fos_config_parse.c so they can be host-tested; this file keeps
 * NVS, the defaults and the chip-specific pin table. */

static const char *TAG = "fos_config";
static const char *NVS_NS = "frameos";

static fos_config_t s_config;

fos_config_t *fos_config(void) { return &s_config; }

static void load_defaults(void)
{
    memset(&s_config, 0, sizeof(s_config));
    strlcpy(s_config.wifi_ssid, FRAMEOS_DEFAULT_WIFI_SSID, sizeof(s_config.wifi_ssid));
    strlcpy(s_config.wifi_pass, FRAMEOS_DEFAULT_WIFI_PASS, sizeof(s_config.wifi_pass));
    strlcpy(s_config.backend_url, FRAMEOS_DEFAULT_BACKEND_URL, sizeof(s_config.backend_url));
    strlcpy(s_config.api_key, FRAMEOS_DEFAULT_API_KEY, sizeof(s_config.api_key));
    s_config.frame_id = FRAMEOS_DEFAULT_FRAME_ID;
    strlcpy(s_config.hostname, FRAMEOS_DEFAULT_HOSTNAME, sizeof(s_config.hostname));
    strlcpy(s_config.hardware_preset, FRAMEOS_DEFAULT_HARDWARE_PRESET, sizeof(s_config.hardware_preset));
    strlcpy(s_config.panel, FRAMEOS_DEFAULT_PANEL, sizeof(s_config.panel));
    s_config.render_mode = (fos_render_mode_t)FRAMEOS_DEFAULT_RENDER_MODE;
    s_config.rotate = FRAMEOS_DEFAULT_ROTATE;
    strlcpy(s_config.scaling_mode, FRAMEOS_DEFAULT_SCALING_MODE, sizeof(s_config.scaling_mode));
    strlcpy(s_config.time_zone, FRAMEOS_DEFAULT_TIME_ZONE, sizeof(s_config.time_zone));
    s_config.interval_sec = FRAMEOS_DEFAULT_INTERVAL_SEC;
    s_config.max_http_response_bytes = FRAMEOS_DEFAULT_MAX_HTTP_RESPONSE_BYTES;
    s_config.server_send_logs = FRAMEOS_DEFAULT_SERVER_SEND_LOGS;
    /* Fusion is the normal path; the flag exists so a render can be repeated
     * with every image edge materialized and the two panels compared. */
    s_config.image_fusion = true;
    s_config.allow_local_network = FRAMEOS_DEFAULT_ALLOW_LOCAL_NETWORK;
    s_config.tls_enable = FRAMEOS_DEFAULT_TLS_ENABLE;
    s_config.tls_port = FRAMEOS_DEFAULT_TLS_PORT;
    strlcpy(s_config.tls_server_cert, FRAMEOS_DEFAULT_TLS_SERVER_CERT, sizeof(s_config.tls_server_cert));
    strlcpy(s_config.tls_server_key, FRAMEOS_DEFAULT_TLS_SERVER_KEY, sizeof(s_config.tls_server_key));
    s_config.admin_auth_enabled = FRAMEOS_DEFAULT_ADMIN_AUTH_ENABLE;
    strlcpy(s_config.admin_user, FRAMEOS_DEFAULT_ADMIN_AUTH_USER, sizeof(s_config.admin_user));
    strlcpy(s_config.admin_pass, FRAMEOS_DEFAULT_ADMIN_AUTH_PASS, sizeof(s_config.admin_pass));
    strlcpy(s_config.assets_path, FRAMEOS_DEFAULT_ASSETS_PATH, sizeof(s_config.assets_path));
    s_config.assets_sd.enabled = FRAMEOS_DEFAULT_ASSETS_SD_ENABLE;
    s_config.assets_sd.autoformat = FRAMEOS_DEFAULT_ASSETS_SD_AUTOFORMAT;
    s_config.assets_sd.cs = FRAMEOS_DEFAULT_ASSETS_SD_PIN_CS;
    s_config.assets_sd.sck = FRAMEOS_DEFAULT_ASSETS_SD_PIN_SCK;
    s_config.assets_sd.miso = FRAMEOS_DEFAULT_ASSETS_SD_PIN_MISO;
    s_config.assets_sd.mosi = FRAMEOS_DEFAULT_ASSETS_SD_PIN_MOSI;
    s_config.assets_sd.max_freq_khz = FRAMEOS_DEFAULT_ASSETS_SD_MAX_FREQ_KHZ;
    s_config.deep_sleep = FRAMEOS_DEFAULT_DEEP_SLEEP;
    s_config.deep_sleep_on_battery = FRAMEOS_DEFAULT_DEEP_SLEEP_ON_BATTERY;
    s_config.wake_schedule = FRAMEOS_DEFAULT_WAKE_SCHEDULE;
    s_config.wake_check_sec = FRAMEOS_DEFAULT_WAKE_CHECK_SEC;
    s_config.battery_pin = FRAMEOS_DEFAULT_BATTERY_PIN;
    s_config.battery_divider = FRAMEOS_DEFAULT_BATTERY_DIVIDER;
    s_config.battery_enable_pin = FRAMEOS_DEFAULT_BATTERY_ENABLE_PIN;
    fos_config_parse_gpio_buttons(FRAMEOS_DEFAULT_GPIO_BUTTONS, &s_config);
    s_config.pins.rst = FRAMEOS_DEFAULT_PIN_RST;
    s_config.pins.dc = FRAMEOS_DEFAULT_PIN_DC;
    s_config.pins.cs = FRAMEOS_DEFAULT_PIN_CS;
    s_config.pins.cs2 = FRAMEOS_DEFAULT_PIN_CS2;
    s_config.pins.busy = FRAMEOS_DEFAULT_PIN_BUSY;
    s_config.pins.sck = FRAMEOS_DEFAULT_PIN_SCK;
    s_config.pins.mosi = FRAMEOS_DEFAULT_PIN_MOSI;
    s_config.pins.pwr = FRAMEOS_DEFAULT_PIN_PWR;
}

static void nvs_get_string(nvs_handle_t nvs, const char *key, char *out, size_t out_len)
{
    size_t len = out_len;
    if (nvs_get_str(nvs, key, out, &len) != ESP_OK) {
        /* keep the default */
    }
}

/* PEM material lives in a blob: NVS strings top out at ~4000 bytes, and a
 * certificate chain can be longer than that. Absent or oversized keeps the
 * default (empty); the buffer is always NUL-terminated. */
static void nvs_get_pem(nvs_handle_t nvs, const char *key, char *out, size_t out_len)
{
    size_t len = out_len - 1;
    if (nvs_get_blob(nvs, key, out, &len) == ESP_OK) {
        out[len] = '\0';
    } else {
        out[0] = '\0';
    }
}

static esp_err_t nvs_set_pem(nvs_handle_t nvs, const char *key, const char *pem)
{
    if (pem[0]) {
        return nvs_set_blob(nvs, key, pem, strlen(pem));
    }
    esp_err_t err = nvs_erase_key(nvs, key);
    return err == ESP_ERR_NVS_NOT_FOUND ? ESP_OK : err;
}

esp_err_t fos_config_init(void)
{
    esp_err_t err = nvs_flash_init();
    if (err == ESP_ERR_NVS_NO_FREE_PAGES || err == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_LOGW(TAG, "NVS partition needs erase (%s)", esp_err_to_name(err));
        ESP_ERROR_CHECK(nvs_flash_erase());
        err = nvs_flash_init();
    }
    if (err != ESP_OK) {
        return err;
    }

    load_defaults();

    nvs_handle_t nvs;
    err = nvs_open(NVS_NS, NVS_READONLY, &nvs);
    if (err == ESP_ERR_NVS_NOT_FOUND) {
        ESP_LOGI(TAG, "no stored config, using generic defaults");
        return ESP_OK;
    }
    if (err != ESP_OK) {
        return err;
    }

    nvs_get_string(nvs, "wifi_ssid", s_config.wifi_ssid, sizeof(s_config.wifi_ssid));
    nvs_get_string(nvs, "wifi_pass", s_config.wifi_pass, sizeof(s_config.wifi_pass));
    nvs_get_string(nvs, "backend_url", s_config.backend_url, sizeof(s_config.backend_url));
    nvs_get_string(nvs, "api_key", s_config.api_key, sizeof(s_config.api_key));
    nvs_get_string(nvs, "cloud_url", s_config.cloud_url, sizeof(s_config.cloud_url));
    nvs_get_string(nvs, "claim_token", s_config.claim_token, sizeof(s_config.claim_token));
    nvs_get_string(nvs, "hostname", s_config.hostname, sizeof(s_config.hostname));
    nvs_get_string(nvs, "hardware", s_config.hardware_preset, sizeof(s_config.hardware_preset));
    nvs_get_string(nvs, "panel", s_config.panel, sizeof(s_config.panel));
    nvs_get_string(nvs, "assets_path", s_config.assets_path, sizeof(s_config.assets_path));
    nvs_get_string(nvs, "admin_user", s_config.admin_user, sizeof(s_config.admin_user));
    nvs_get_string(nvs, "admin_pass", s_config.admin_pass, sizeof(s_config.admin_pass));
    nvs_get_string(nvs, "ap_psk", s_config.ap_psk, sizeof(s_config.ap_psk));
    char gpio_buttons[FOS_GPIO_BUTTONS_SPEC_LEN] = "";
    size_t gpio_buttons_len = sizeof(gpio_buttons);
    esp_err_t buttons_err = nvs_get_str(nvs, "gpio_buttons", gpio_buttons, &gpio_buttons_len);
    if (buttons_err == ESP_OK) {
        buttons_err = fos_config_parse_gpio_buttons(gpio_buttons, &s_config);
        if (buttons_err != ESP_OK) {
            ESP_LOGW(TAG, "stored GPIO button config invalid: %s", esp_err_to_name(buttons_err));
        }
    }
    uint32_t u32;
    if (nvs_get_u32(nvs, "frame_id", &u32) == ESP_OK) s_config.frame_id = u32;
    if (nvs_get_u32(nvs, "interval", &u32) == ESP_OK) s_config.interval_sec = u32;
    if (nvs_get_u32(nvs, "spill_force", &u32) == ESP_OK) s_config.http_spill_force_bytes = u32;
    uint16_t rotate_u16 = 0;
    if (nvs_get_u16(nvs, "rotate", &rotate_u16) == ESP_OK &&
        (rotate_u16 == 0 || rotate_u16 == 90 || rotate_u16 == 180 || rotate_u16 == 270)) {
        s_config.rotate = rotate_u16;
    }
    char scaling_raw[16];
    size_t scaling_len = sizeof(scaling_raw);
    if (nvs_get_str(nvs, "scaling", scaling_raw, &scaling_len) == ESP_OK) {
        /* Validated on read like rotate: a corrupt or legacy value falls back
         * to the baked default instead of poisoning every render. */
        char normalized[16];
        if (fos_config_normalize_scaling_mode(scaling_raw, normalized, sizeof(normalized))) {
            strlcpy(s_config.scaling_mode, normalized, sizeof(s_config.scaling_mode));
        }
    }
    size_t tz_len = sizeof(s_config.time_zone);
    if (nvs_get_str(nvs, "time_zone", s_config.time_zone, &tz_len) != ESP_OK) {
        s_config.time_zone[0] = '\0';
    }
    if (nvs_get_u32(nvs, "max_http", &u32) == ESP_OK) s_config.max_http_response_bytes = u32;
    uint8_t u8;
    if (nvs_get_u8(nvs, "render_mode", &u8) == ESP_OK) s_config.render_mode = (fos_render_mode_t)u8;
    if (nvs_get_u8(nvs, "send_logs", &u8) == ESP_OK) s_config.server_send_logs = u8 != 0;
    if (nvs_get_u8(nvs, "debug", &u8) == ESP_OK) s_config.debug_logging = u8 != 0;
    if (nvs_get_u8(nvs, "fusion", &u8) == ESP_OK) s_config.image_fusion = u8 != 0;
    if (nvs_get_u8(nvs, "allow_lan", &u8) == ESP_OK) s_config.allow_local_network = u8 != 0;
    if (nvs_get_u8(nvs, "tls_enable", &u8) == ESP_OK) s_config.tls_enable = u8 != 0;
    if (nvs_get_u8(nvs, "admin_auth", &u8) == ESP_OK) s_config.admin_auth_enabled = u8 != 0;
    if (nvs_get_u32(nvs, "tls_port", &u32) == ESP_OK) s_config.tls_port = (uint16_t)u32;
    nvs_get_pem(nvs, "tls_cert", s_config.tls_server_cert, sizeof(s_config.tls_server_cert));
    nvs_get_pem(nvs, "tls_key", s_config.tls_server_key, sizeof(s_config.tls_server_key));
    int8_t i8;
    if (nvs_get_u8(nvs, "assets_sd", &u8) == ESP_OK) s_config.assets_sd.enabled = u8 != 0;
    if (nvs_get_u8(nvs, "sd_autofmt", &u8) == ESP_OK) s_config.assets_sd.autoformat = u8 != 0;
    if (nvs_get_i8(nvs, "sd_cs", &i8) == ESP_OK) s_config.assets_sd.cs = i8;
    if (nvs_get_i8(nvs, "sd_sck", &i8) == ESP_OK) s_config.assets_sd.sck = i8;
    if (nvs_get_i8(nvs, "sd_miso", &i8) == ESP_OK) s_config.assets_sd.miso = i8;
    if (nvs_get_i8(nvs, "sd_mosi", &i8) == ESP_OK) s_config.assets_sd.mosi = i8;
    if (nvs_get_u32(nvs, "sd_freq", &u32) == ESP_OK) s_config.assets_sd.max_freq_khz = u32;
    if (nvs_get_u8(nvs, "deep_sleep", &u8) == ESP_OK) s_config.deep_sleep = u8 != 0;
    if (nvs_get_u8(nvs, "sleep_batt", &u8) == ESP_OK) s_config.deep_sleep_on_battery = u8 != 0;
    if (nvs_get_u8(nvs, "wake_sched", &u8) == ESP_OK) s_config.wake_schedule = u8 != 0;
    if (nvs_get_u32(nvs, "wake_check", &u32) == ESP_OK) s_config.wake_check_sec = u32;
    if (nvs_get_i8(nvs, "batt_pin", &i8) == ESP_OK) s_config.battery_pin = i8;
    if (nvs_get_u32(nvs, "batt_div_m", &u32) == ESP_OK) s_config.battery_divider = (float)u32 / 1000.0f;
    if (nvs_get_i8(nvs, "batt_en", &i8) == ESP_OK) s_config.battery_enable_pin = i8;
    char pins[FOS_STR_LEN] = "";
    nvs_get_string(nvs, "pins", pins, sizeof(pins));
    if (pins[0]) fos_config_parse_pins(pins, &s_config.pins);
    nvs_close(nvs);

    ESP_LOGI(TAG, "config loaded: frame_id=%lu hostname=%s panel=%s mode=%s interval=%lus logs=%s tls=%s:%u admin=%s assets_sd=%s buttons=%u wifi=%s backend=%s",
             (unsigned long)s_config.frame_id, s_config.hostname[0] ? s_config.hostname : "(unset)", s_config.panel,
             s_config.render_mode == FOS_RENDER_LOCAL ? "local" : "remote",
             (unsigned long)s_config.interval_sec, s_config.server_send_logs ? "on" : "off",
             s_config.tls_enable ? "on" : "off", (unsigned)s_config.tls_port,
             (s_config.admin_auth_enabled && s_config.admin_user[0] && s_config.admin_pass[0]) ? "on" : "off",
             s_config.assets_sd.enabled ? "on" : "off",
             (unsigned)s_config.gpio_button_count,
             s_config.wifi_ssid[0] ? s_config.wifi_ssid : "(unset)",
             s_config.backend_url[0] ? s_config.backend_url : "(unset)");
    if (s_config.cloud_url[0] || s_config.claim_token[0]) {
        /* never log the claim token itself */
        ESP_LOGI(TAG, "cloud config: url=%s claim_token=%s",
                 s_config.cloud_url[0] ? s_config.cloud_url : "(unset)",
                 s_config.claim_token[0] ? "(set)" : "(none)");
    }
    return ESP_OK;
}

esp_err_t fos_config_save(void)
{
    nvs_handle_t nvs;
    esp_err_t err = nvs_open(NVS_NS, NVS_READWRITE, &nvs);
    if (err != ESP_OK) return err;

    /* Every write is checked: a full partition fails a `set` with
     * ESP_ERR_NVS_NOT_ENOUGH_SPACE while the commit still succeeds, which
     * used to pass as a saved config (the board came back with its old
     * Wi-Fi network after `wifi <ssid>`; 4 MB C3 with a TLS pair in a 16 KB
     * NVS, 2026-09-05). The first failure is reported with its key; the
     * remaining keys are still attempted so an unrelated setting is not
     * lost to an earlier one. */
    esp_err_t first_err = ESP_OK;
    const char *first_key = NULL;
#define FOS_NVS_SET(call, key_name)                                           \
    do {                                                                      \
        esp_err_t set_err_ = (call);                                          \
        if (set_err_ != ESP_OK && first_err == ESP_OK) {                      \
            first_err = set_err_;                                             \
            first_key = (key_name);                                           \
        }                                                                     \
    } while (0)
    FOS_NVS_SET(nvs_set_str(nvs, "wifi_ssid", s_config.wifi_ssid), "wifi_ssid");
    FOS_NVS_SET(nvs_set_str(nvs, "wifi_pass", s_config.wifi_pass), "wifi_pass");
    FOS_NVS_SET(nvs_set_str(nvs, "backend_url", s_config.backend_url), "backend_url");
    FOS_NVS_SET(nvs_set_str(nvs, "api_key", s_config.api_key), "api_key");
    FOS_NVS_SET(nvs_set_str(nvs, "cloud_url", s_config.cloud_url), "cloud_url");
    /* The claim token is single use: once enrollment consumes it the struct
     * field is cleared and the NVS key must disappear, not persist as "". */
    if (s_config.claim_token[0]) {
        FOS_NVS_SET(nvs_set_str(nvs, "claim_token", s_config.claim_token), "claim_token");
    } else {
        nvs_erase_key(nvs, "claim_token");
    }
    FOS_NVS_SET(nvs_set_str(nvs, "hostname", s_config.hostname), "hostname");
    FOS_NVS_SET(nvs_set_str(nvs, "hardware", s_config.hardware_preset), "hardware");
    FOS_NVS_SET(nvs_set_str(nvs, "panel", s_config.panel), "panel");
    FOS_NVS_SET(nvs_set_str(nvs, "assets_path", s_config.assets_path), "assets_path");
    FOS_NVS_SET(nvs_set_str(nvs, "admin_user", s_config.admin_user), "admin_user");
    FOS_NVS_SET(nvs_set_str(nvs, "admin_pass", s_config.admin_pass), "admin_pass");
    FOS_NVS_SET(nvs_set_str(nvs, "ap_psk", s_config.ap_psk), "ap_psk");
    FOS_NVS_SET(nvs_set_u32(nvs, "frame_id", s_config.frame_id), "frame_id");
    FOS_NVS_SET(nvs_set_u32(nvs, "interval", s_config.interval_sec), "interval");
    FOS_NVS_SET(nvs_set_u16(nvs, "rotate", s_config.rotate), "rotate");
    FOS_NVS_SET(nvs_set_str(nvs, "scaling", s_config.scaling_mode), "scaling");
    FOS_NVS_SET(nvs_set_str(nvs, "time_zone", s_config.time_zone), "time_zone");
    FOS_NVS_SET(nvs_set_u32(nvs, "max_http", s_config.max_http_response_bytes), "max_http");
    FOS_NVS_SET(nvs_set_u32(nvs, "spill_force", s_config.http_spill_force_bytes), "spill_force");
    FOS_NVS_SET(nvs_set_u8(nvs, "render_mode", (uint8_t)s_config.render_mode), "render_mode");
    FOS_NVS_SET(nvs_set_u8(nvs, "send_logs", s_config.server_send_logs ? 1 : 0), "send_logs");
    FOS_NVS_SET(nvs_set_u8(nvs, "debug", s_config.debug_logging ? 1 : 0), "debug");
    FOS_NVS_SET(nvs_set_u8(nvs, "fusion", s_config.image_fusion ? 1 : 0), "fusion");
    FOS_NVS_SET(nvs_set_u8(nvs, "allow_lan", s_config.allow_local_network ? 1 : 0), "allow_lan");
    FOS_NVS_SET(nvs_set_u8(nvs, "tls_enable", s_config.tls_enable ? 1 : 0), "tls_enable");
    FOS_NVS_SET(nvs_set_u8(nvs, "admin_auth", s_config.admin_auth_enabled ? 1 : 0), "admin_auth");
    FOS_NVS_SET(nvs_set_u32(nvs, "tls_port", s_config.tls_port), "tls_port");
    FOS_NVS_SET(nvs_set_pem(nvs, "tls_cert", s_config.tls_server_cert), "tls_cert");
    FOS_NVS_SET(nvs_set_pem(nvs, "tls_key", s_config.tls_server_key), "tls_key");
    FOS_NVS_SET(nvs_set_u8(nvs, "assets_sd", s_config.assets_sd.enabled ? 1 : 0), "assets_sd");
    FOS_NVS_SET(nvs_set_u8(nvs, "sd_autofmt", s_config.assets_sd.autoformat ? 1 : 0), "sd_autofmt");
    FOS_NVS_SET(nvs_set_i8(nvs, "sd_cs", s_config.assets_sd.cs), "sd_cs");
    FOS_NVS_SET(nvs_set_i8(nvs, "sd_sck", s_config.assets_sd.sck), "sd_sck");
    FOS_NVS_SET(nvs_set_i8(nvs, "sd_miso", s_config.assets_sd.miso), "sd_miso");
    FOS_NVS_SET(nvs_set_i8(nvs, "sd_mosi", s_config.assets_sd.mosi), "sd_mosi");
    FOS_NVS_SET(nvs_set_u32(nvs, "sd_freq", s_config.assets_sd.max_freq_khz), "sd_freq");
    FOS_NVS_SET(nvs_set_u8(nvs, "deep_sleep", s_config.deep_sleep ? 1 : 0), "deep_sleep");
    FOS_NVS_SET(nvs_set_u8(nvs, "sleep_batt", s_config.deep_sleep_on_battery ? 1 : 0), "sleep_batt");
    FOS_NVS_SET(nvs_set_u8(nvs, "wake_sched", s_config.wake_schedule ? 1 : 0), "wake_sched");
    FOS_NVS_SET(nvs_set_u32(nvs, "wake_check", s_config.wake_check_sec), "wake_check");
    FOS_NVS_SET(nvs_set_i8(nvs, "batt_pin", s_config.battery_pin), "batt_pin");
    FOS_NVS_SET(nvs_set_u32(nvs, "batt_div_m", (uint32_t)(s_config.battery_divider * 1000.0f)), "batt_div_m");
    FOS_NVS_SET(nvs_set_i8(nvs, "batt_en", s_config.battery_enable_pin), "batt_en");
    char gpio_buttons[FOS_GPIO_BUTTONS_SPEC_LEN];
    fos_config_format_gpio_buttons(&s_config, gpio_buttons, sizeof(gpio_buttons));
    FOS_NVS_SET(nvs_set_str(nvs, "gpio_buttons", gpio_buttons), "gpio_buttons");
    char pins[FOS_STR_LEN];
    fos_config_format_pins(&s_config.pins, pins, sizeof(pins));
    FOS_NVS_SET(nvs_set_str(nvs, "pins", pins), "pins");

    err = nvs_commit(nvs);
    nvs_close(nvs);
#undef FOS_NVS_SET
    if (first_err != ESP_OK) {
        nvs_stats_t stats = {0};
        nvs_get_stats(NULL, &stats);
        ESP_LOGW(TAG, "config save: %s not stored: %s (nvs %u/%u entries used, %u free)",
                 first_key, esp_err_to_name(first_err), (unsigned)stats.used_entries,
                 (unsigned)stats.total_entries, (unsigned)stats.free_entries);
        return first_err;
    }
    ESP_LOGI(TAG, "config saved");
    return err;
}

esp_err_t fos_config_nvs_stats(size_t *used_entries, size_t *free_entries, size_t *total_entries)
{
    nvs_stats_t stats = {0};
    esp_err_t err = nvs_get_stats(NULL, &stats);
    if (used_entries) *used_entries = stats.used_entries;
    if (free_entries) *free_entries = stats.free_entries;
    if (total_entries) *total_entries = stats.total_entries;
    return err;
}



esp_err_t fos_config_erase(void)
{
    nvs_handle_t nvs;
    esp_err_t err = nvs_open(NVS_NS, NVS_READWRITE, &nvs);
    if (err != ESP_OK) return err;
    err = nvs_erase_all(nvs);
    if (err == ESP_OK) err = nvs_commit(nvs);
    nvs_close(nvs);
    load_defaults();
    return err;
}

bool fos_config_wifi_ready(void)
{
    return s_config.wifi_ssid[0] != '\0';
}

/* The chip's SPI flash / PSRAM pads, by target. esp_gpio_is_reserved below
 * knows the same pins once the flash and PSRAM drivers have claimed them,
 * but this table does not depend on that having happened yet, and names the
 * reason. */
static bool gpio_pin_is_memory_pad(int pin)
{
#if CONFIG_IDF_TARGET_ESP32S3
    /* GPIO26-32: the in-package / module SPI flash (and a quad PSRAM).
     * GPIO33-37: the four extra data lines of octal PSRAM / octal flash. */
    if (pin >= 26 && pin <= 32) return true;
#if CONFIG_SPIRAM_MODE_OCT || CONFIG_ESPTOOLPY_OCT_FLASH
    if (pin >= 33 && pin <= 37) return true;
#endif
#elif CONFIG_IDF_TARGET_ESP32
    /* GPIO6-11: SPI flash. GPIO16/17: PSRAM CS / CLK on the WROVER modules. */
    if (pin >= 6 && pin <= 11) return true;
#if CONFIG_SPIRAM
    if (pin == 16 || pin == 17) return true;
#endif
#elif CONFIG_IDF_TARGET_ESP32C3
    /* GPIO12-17: the in-package SPI flash of the C3 modules FrameOS runs on. */
    if (pin >= 12 && pin <= 17) return true;
#endif
    return false;
}

const char *fos_config_gpio_pin_reserved(int pin)
{
    if (pin < 0 || pin >= SOC_GPIO_PIN_COUNT || !GPIO_IS_VALID_GPIO(pin)) {
        return "not a GPIO on this chip";
    }
    if (gpio_pin_is_memory_pad(pin)) return "SPI flash / PSRAM pad";
    if (esp_gpio_is_reserved(BIT64(pin))) return "claimed by a driver";
    return NULL;
}
